# PhaseFilter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseFilter Class
Members See Also
---
Represents an phase filter within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class PhaseFilter : Element
```

Visual Basic
---
```text
Public Class PhaseFilter _
	Inherits Element
```

Visual C++
---
```text
public ref class PhaseFilter : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..PhaseFilter
# See Also
PhaseFilter Members
Autodesk.Revit.DB Namespace